app/controllers/posts_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "posts" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", nil], ["description", nil], ["updated_at", "2018-09-23 21:01:45.182877"], ["id", 3]]
---
  def update
    @post = Post.find(params[:id])
    @post.update({
      title: params[:post][:title],
      description: params[:post][:description]
      })